<a href="https://colab.research.google.com/github/Niyati-Sinha/PYTHON-Codes-By-Niyati-Sinha/blob/master/TNT%20LAB/1805501_tnt_LAB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##1805501 
#Niyati Sinha

Q1 CREATE PANDAS COLUMN USING LOOP

In [ ]:
# importing pandas 
import pandas as pd 

# Creating new dataframe 
initial_data = {'First_name': ['Niyati', 'Mohan', 'Tina', 'Jeetu', 'Meera'], 
				'Last_name': ['Sinha', 'Sharma', 'Ali', 'Gandhi', 'Kumari'], 
				'Marks': [12, 52, 36, 85, 23] } 

df = pd.DataFrame(initial_data, columns = ['First_name', 'Last_name', 'Marks']) 

# Generate result using pandas 
result = [] 
for value in df["Marks"]: 
	if value >= 33: 
		result.append("Pass") 
	elif value < 0 and value > 100: 
		result.append("Invalid") 
	else: 
		result.append("Fail") 
	
df["Result"] = result 
print(df)

  First_name Last_name  Marks Result
0     Niyati     Sinha     12   Fail
1      Mohan    Sharma     52   Pass
2       Tina       Ali     36   Pass
3      Jeetu    Gandhi     85   Pass
4      Meera    Kumari     23   Fail

Q2 GET COLUMN NAMES

In [ ]:
# Import pandas package 
import pandas as pd 
	
# making data frame 
data = pd.read_csv("Iris.csv") 
	
# calling head() method 
# storing in new variable 
data_top = data.head() 
	
# display 
data_top

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

Q3 RENAMING COLUMN

In [ ]:
# Import pandas package 
import pandas as pd 

# Define a dictionary containing ICC rankings 
rankings = {'test': ['India', 'South Africa', 'England', 
							'New Zealand', 'Australia'], 
			'odi': ['England', 'India', 'New Zealand', 
							'South Africa', 'Pakistan'], 
			't20': ['Pakistan', 'India', 'Australia', 
							'England', 'New Zealand']} 

# Convert the dictionary into DataFrame 
rankings_pd = pd.DataFrame(rankings) 

# Before renaming the columns 
print(rankings_pd.columns) 

rankings_pd.rename(columns = {'test':'TEST', 'odi':'ODI', 
							't20':'T20'}, inplace = True) 

# After renaming the columns 
print(rankings_pd.columns)

Index(['test', 'odi', 't20'], dtype='object')
Index(['TEST', 'ODI', 'T20'], dtype='object')

Q4 COLLAPSING MULTIPLE COLUMNS

In [ ]:
# Python program to collapse 
# multiple Columns using Pandas 
import pandas as pd 

# sample data 
n = 3
Sample_1 = [57, 51, 6] 
Sample_2 = [92, 16, 19] 
Sample_3 = [15, 93, 71] 
Sample_4 = [28, 73, 31] 

sample_id = zip(["S"]*n, list(range(1, n + 1))) 

s_names = [''.join([w[0], str(w[1])]) for w in sample_id] 

d = {'s_names': s_names, 'Sample_1': Sample_1, 
	'Sample_2': Sample_2, 'Sample_3': Sample_3, 
	'Sample_4': Sample_4} 

df_1 = pd.DataFrame(d) 

mapping = {'Sample_1': 'Result_1', 
		'Sample_2': 'Result_1', 
		'Sample_3': 'Result_2', 
		'Sample_4': 'Result_2'} 

df = df_1.set_index('s_names').groupby(mapping, axis = 1).sum() 

df.reset_index(level = 0)

  s_names  Result_1  Result_2
0      S1       149        43
1      S2        67       166
2      S3        25       102

Q5 UNIQUE COLUMNS

In [ ]:
# Import pandas package 
import pandas as pd 

# create a dictionary with five fields each 
data = { 
	'A':['A1', 'A2', 'A3', 'A4', 'A5'], 
	'B':['B1', 'B2', 'B3', 'B4', 'B4'], 
	'C':['C1', 'C2', 'C3', 'C3', 'C3'], 
	'D':['D1', 'D2', 'D2', 'D2', 'D2'], 
	'E':['E1', 'E1', 'E1', 'E1', 'E1'] } 

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 

# Get the unique values of 'B' column 
df.B.unique()

array(['B1', 'B2', 'B3', 'B4'], dtype=object)

Q6 CONDITIONAL OPERATION

In [ ]:
# importing pandas as pd 
import pandas as pd 

# Create the dataframe 
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'], 
				'Product':['Umbrella', 'Matress', 'Badminton', 'Shuttle'], 
				'Last Price':[1200, 1500, 1600, 352], 
				'Updated Price':[1250, 1450, 1550, 400], 
				'Discount':[10, 10, 10, 10]}) 

# Print the dataframe 
print(df) 

# Check if the updated price is available or not 
if 'Updated Price' in df.columns: 
	df['Final cost'] = df['Updated Price'] - (df['Updated Price']*0.1) 

else : 
	df['Final cost'] = df['Last Price'] - (df['Last Price']*0.1) 

# Print the Dataframe 
print(df)

        Date    Product  Last Price  Updated Price  Discount
0  10/2/2011   Umbrella        1200           1250        10
1  11/2/2011    Matress        1500           1450        10
2  12/2/2011  Badminton        1600           1550        10
3  13/2/2011    Shuttle         352            400        10
        Date    Product  Last Price  Updated Price  Discount  Final cost
0  10/2/2011   Umbrella        1200           1250        10      1125.0
1  11/2/2011    Matress        1500           1450        10      1305.0
2  12/2/2011  Badminton        1600           1550        10      1395.0
3  13/2/2011    Shuttle         352            400        10       360.0

Q7 RETURNING INDEX

In [ ]:
# importing pandas as pd
import pandas as pd

# Create the dataframe
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
				'Product':['Umbrella', 'Matress', 'Badminton', 'Shuttle'],
				'Last_Price':[1200, 1500, 1600, 352],
				'Updated_Price':[1250, 1450, 1550, 400],
				'Discount':[10, 10, 10, 10]})

# Create the indexes
df.index =['Item 1', 'Item 2', 'Item 3', 'Item 4']

# Print the dataframe
print(df)

# Select all the rows which satisfies the criteria
# convert the collection of index labels to list.
Index_label = df[df['Updated_Price']>1000].index.tolist()

# Print all the labels
print(Index_label)

             Date    Product  Last_Price  Updated_Price  Discount
Item 1  10/2/2011   Umbrella        1200           1250        10
Item 2  11/2/2011    Matress        1500           1450        10
Item 3  12/2/2011  Badminton        1600           1550        10
Item 4  13/2/2011    Shuttle         352            400        10
['Item 1', 'Item 2', 'Item 3']

Q8 FORMATTING INTEGER COLUMNS

In [ ]:
# import pandas lib as pd
import pandas as pd

# create the data dictionary
data = {'Month' : ['January', 'February', 'March', 'April'],
	'Expense': [ 21525220.653, 31125840.875, 23135428.768, 56245263.942]}

# create the dataframe
dataframe = pd.DataFrame(data, columns = ['Month', 'Expense'])

print("Given Dataframe :\n", dataframe)

# round to two decimal places in python pandas
pd.options.display.float_format = '{:2f}'.format

print('\nResult :\n', dataframe)

Given Dataframe :
       Month       Expense
0   January  2.152522e+07
1  February  3.112584e+07
2     March  2.313543e+07
3     April  5.624526e+07

Result :
       Month         Expense
0   January 21525220.653000
1  February 31125840.875000
2     March 23135428.768000
3     April 56245263.942000

Q9 Creating a new column in Pandas based on existing column

In [ ]:
# importing pandas as pd 
import pandas as pd 

# Creating the DataFrame 
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'], 
					'Event':['Music', 'Poetry', 'Theatre', 'Comedy'], 
					'Cost':[10000, 5000, 15000, 2000]}) 

# Print the dataframe 
print(df) 

# using apply function to create a new column 
df['Discounted_Price'] = df.apply(lambda row: row.Cost -
								(row.Cost * 0.1), axis = 1) 

# Print the DataFrame after addition 
# of new column 
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000
        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000       9000.000000
1  11/2/2011   Poetry   5000       4500.000000
2  12/2/2011  Theatre  15000      13500.000000
3  13/2/2011   Comedy   2000       1800.000000

Q 10. creating pandas dataframe column based on condition

In [ ]:
# importing pandas as pd
import pandas as pd

# Creating the dataframe
df = pd.DataFrame({'Date' : ['11/8/2011', '11/9/2011', '11/10/2011',
										'11/11/2011', '11/12/2011'],
				'Event' : ['Music', 'Poetry', 'Music', 'Music', 'Poetry']})

# Print the dataframe
print(df)

# Add a new column named 'Price'
df['Price'] = [1500 if x =='Music' else 800 for x in df['Event']]

# Print the DataFrame
print(df)

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011   Music
4  11/12/2011  Poetry
         Date   Event  Price
0   11/8/2011   Music   1500
1   11/9/2011  Poetry    800
2  11/10/2011   Music   1500
3  11/11/2011   Music   1500
4  11/12/2011  Poetry    800

Q11 Getting unique values from a pandas column

In [ ]:
# Import pandas package 
import pandas as pd 

# create a dictionary with five fields each 
data = { 
	'A':['A1', 'A2', 'A3', 'A4', 'A5'], 
	'B':['B1', 'B2', 'B3', 'B4', 'B4'], 
	'C':['C1', 'C2', 'C3', 'C3', 'C3'], 
	'D':['D1', 'D2', 'D2', 'D2', 'D2'], 
	'E':['E1', 'E1', 'E1', 'E1', 'E1'] } 

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 

# Get the unique values of 'B' column 
df.B.unique()

array(['B1', 'B2', 'B3', 'B4'], dtype=object)

Q12 Splitting string

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'Geek_ID':['Geek1_id', 'Geek2_id', 'Geek3_id',
										'Geek4_id', 'Geek5_id'],
				'Geek_A': [1, 1, 3, 2, 4],
				'Geek_B': [1, 2, 3, 4, 6],
				'Geek_R': np.random.randn(5)})



print(df.Geek_ID.str.split('_').str[0])

0    Geek1
1    Geek2
2    Geek3
3    Geek4
4    Geek5
Name: Geek_ID, dtype: object

In [ ]:
import pandas as pd

dict = {'movie_data':['The Godfather 1972 9.2',
					'Bird Box 2018 6.8',
					'Fight Club 1999 8.8'] }

# Convert the dictionary to a dataframe
df = pd.DataFrame(dict)

# Extract name from the string
df['Name'] = df['movie_data'].str.extract('(\w*\s\w*)', expand=True)

# Extract year from the string
df['Year'] = df['movie_data'].str.extract('(\d\d\d\d)', expand=True)

# Extract rating from the string
df['Rating'] = df['movie_data'].str.extract('(\d\.\d)', expand=True)
print(df)

               movie_data           Name  Year Rating
0  The Godfather 1972 9.2  The Godfather  1972    9.2
1       Bird Box 2018 6.8       Bird Box  2018    6.8
2     Fight Club 1999 8.8     Fight Club  1999    8.8

Q13 Frequency of column

In [ ]:
import pandas as pd
  

df = pd.DataFrame({'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],  'Price': [22000,25000,27000,35000]
}
)
  
count = df.groupby(['Price']).count()
print(count)

       Brand
Price
22000      1
25000      1
27000      1
35000      1

Q14 Change Data type of column

In [ ]:
print(df.dtypes)

Brand    object
Price     int64
dtype: object

In [ ]:
df_str = df.astype(str)
print(df_str.dtypes)

Brand    object
Price    object
dtype: object

Q15 Split a text column into 2

In [ ]:
df

            Brand  Price
0     Honda Civic  22000
1  Toyota Corolla  25000
2      Ford Focus  27000
3         Audi A4  35000

In [ ]:
#After splitting
print(df.Brand.str.split(expand=True))

        0        1
0   Honda    Civic
1  Toyota  Corolla
2    Ford    Focus
3    Audi       A4

Q16 Difference of two columns

In [ ]:
df1 = { 'Name':['George','Andrea','micheal', 
                'maggie','Ravi','Xien','Jalpa'], 
        'score1':[62,47,55,74,32,77,86], 
        'score2':[45,78,44,89,66,49,72]} 
  
df1 = pd.DataFrame(df1,columns= ['Name','score1','score2']) 
  
print("Original Dataframe :\n", df1) 
  
# getting Difference 
df1['Score_diff'] = df1['score1'] - df1['score2'] 
print("\nDifference of score1 and score2 :\n", df1)

Original Dataframe :
       Name  score1  score2
0   George      62      45
1   Andrea      47      78
2  micheal      55      44
3   maggie      74      89
4     Ravi      32      66
5     Xien      77      49
6    Jalpa      86      72

Difference of score1 and score2 :
       Name  score1  score2  Score_diff
0   George      62      45          17
1   Andrea      47      78         -31
2  micheal      55      44          11
3   maggie      74      89         -15
4     Ravi      32      66         -34
5     Xien      77      49          28
6    Jalpa      86      72          14

Q17 Index of max value in df column

In [ ]:
print('Index of maximum value in DataFrame column')
df1[['Score_diff']].idxmax() # index of maximum value in DataFrame column

Index of maximum value in DataFrame column

Score_diff    5
dtype: int64

Q18 Index of min value column

In [ ]:
print('Index of minimum value in DataFrame column')
df1[['Score_diff']].idxmin()

Index of minimum value in DataFrame column

Score_diff    4
dtype: int64

Q19 n largest values from a column

In [ ]:
print('n-largest values from Score_diff')
n=int(input('enter n < 7'))
df1.nlargest(n, ['Score_diff'])

n-largest values from Score_diff
enter n < 73

     Name  score1  score2  Score_diff
5    Xien      77      49          28
0  George      62      45          17
6   Jalpa      86      72          14

Q20. n smallest values from a column

In [ ]:
print('n-smallest values from Score_diff')
n=int(input('enter n < 7'))
df1.nsmallest(n, ['Score_diff'])

n-smallest values from Score_diff
enter n < 74

      Name  score1  score2  Score_diff
4     Ravi      32      66         -34
1   Andrea      47      78         -31
3   maggie      74      89         -15
2  micheal      55      44          11

Q21. drop one or more columns

In [ ]:
print('Dropping column Score_diff from df1')
df1.drop(['Score_diff'], axis = 1)

Dropping column Score_diff from df1

      Name  score1  score2
0   George      62      45
1   Andrea      47      78
2  micheal      55      44
3   maggie      74      89
4     Ravi      32      66
5     Xien      77      49
6    Jalpa      86      72

Q22 lowercase a column name

In [ ]:
print('Converting Column Names to lowercase')
df= df.rename(columns=str.lower)
df

Converting Column Names to lowercase

            brand  price
0     Honda Civic  22000
1  Toyota Corolla  25000
2      Ford Focus  27000
3         Audi A4  35000

Q23 Capitalize first letter of column

In [ ]:
print('Capitalizing first letter of a column Name')
df1['Name'] = df1['Name'].str.capitalize() 
df1

Capitalizing first letter of a column Name

      Name  score1  score2  Score_diff
0   George      62      45          17
1   Andrea      47      78         -31
2  Micheal      55      44          11
3   Maggie      74      89         -15
4     Ravi      32      66         -34
5     Xien      77      49          28
6    Jalpa      86      72          14

Q24 Apply uppercase to a column

In [ ]:
print('Applying uppercase to a column Name')
df1['Name'] = df1['Name'].str.upper() 
df1

Applying uppercase to a column Name

      Name  score1  score2  Score_diff
0   GEORGE      62      45          17
1   ANDREA      47      78         -31
2  MICHEAL      55      44          11
3   MAGGIE      74      89         -15
4     RAVI      32      66         -34
5     XIEN      77      49          28
6    JALPA      86      72          14

Niyati Sinha 
1805501
Done  all 24 Questions